# IFCAnyHandle Properties

---
The IFCAnyHandle type exposes the following members.
| Name| Description
---|---|---
| HasValue|  Identifies if the handle is empty or contains a value.
| Id|  The integer identifier for the handle.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| StepId|  The step id of the handle. Valid only for import.
| TypeName|  The name of the type of the handle.
Top
#### Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace